/*
Navicat MySQL Data Transfer

Source Server         : Mysql
Source Server Version : 80016
Source Host           : localhost:3306
Source Database       : user

Target Server Type    : MYSQL
Target Server Version : 80016
File Encoding         : 65001

Date: 2019-07-26 14:36:56
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for news
-- ----------------------------
DROP TABLE IF EXISTS `news`;
CREATE TABLE `news` (
  `newsId` int(3) NOT NULL AUTO_INCREMENT,
  `title` varchar(30) DEFAULT NULL,
  `author` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `content` varchar(100) DEFAULT NULL,
  `writeTime` datetime DEFAULT NULL,
  `alterTime` datetime DEFAULT NULL,
  `sortId` int(11) DEFAULT NULL,
  PRIMARY KEY (`newsId`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of news
-- ----------------------------
INSERT INTO `news` VALUES ('1', '信息科学与技术学院', '滕继波', '计算机科学与技术，教育技术，软件工程，图书情报与档案管理', '2019-07-22 18:48:30', '2019-07-25 19:09:45', '1');
INSERT INTO `news` VALUES ('2', '美术学院', '赵雪', '中国画，版画，油画，雕塑，水彩，综合实验艺术，美术教育，环境艺术设计，视觉传达设计，服装设计，动画设计', '2019-07-22 18:58:26', '2019-07-22 18:58:26', '3');
INSERT INTO `news` VALUES ('3', '音乐学院', '申雪寒', '基础理论，音乐学，声乐，钢琴，作曲，舞蹈，流行音乐，管弦', '2019-07-22 19:36:07', '2019-07-22 19:36:07', '3');
INSERT INTO `news` VALUES ('4', '传媒科学学院', '张奎山', '影视编导，播音主持，新闻学，广告学，数字媒体', '2019-07-22 19:38:15', '2019-07-22 19:38:15', '3');
INSERT INTO `news` VALUES ('5', '经济学院', '陈雷', '经济学，国际经济与贸易，金融学，财政学', '2019-07-22 18:54:56', '2019-07-22 18:54:56', '1');
INSERT INTO `news` VALUES ('6', '政法学院', '李红权', '思想政治教育，法学，行政管理，国际政治，政治学与行政学', '2019-07-22 19:22:59', '2019-07-22 19:22:59', '2');
INSERT INTO `news` VALUES ('7', '商学院', '朱春楠', '人力资源管理，市场营销，会计，财务管理，服务业研究中心', '2019-07-22 19:08:34', '2019-07-22 19:08:34', '1');
INSERT INTO `news` VALUES ('8', '外国语学院', '商应美', '英语，日语，俄语，商务英语，大学外语', '2019-07-22 19:09:58', '2019-07-22 19:09:58', '2');
INSERT INTO `news` VALUES ('9', '环境学院', '赵轩', '环境科学，生态学，环境工程', '2019-07-22 19:04:52', '2019-07-22 19:04:52', '1');
INSERT INTO `news` VALUES ('10', '纽瓦克学院', '赵玉宝', '物流管理，金融，公共事业管理', '2019-07-22 18:52:13', '2019-07-22 18:52:13', '2');
INSERT INTO `news` VALUES ('11', '民族教育学院', '马荣华', '一年预科，两年预科', '2019-07-22 19:06:20', '2019-07-22 19:06:20', '5');
INSERT INTO `news` VALUES ('12', '物理学院', '臧丹', '官网没写，咱也不知', '2019-07-22 19:17:36', '2019-07-22 19:17:36', '1');
INSERT INTO `news` VALUES ('13', '化学学院', '杨雨龙', '无机化学，有机化学，物理化学，高分子化学，分析化学', '2019-07-22 19:03:21', '2019-07-22 19:03:21', '1');
INSERT INTO `news` VALUES ('14', '心理学院', '郭庆童', '心理学', '2019-07-22 19:06:49', '2019-07-22 19:06:49', '2');
INSERT INTO `news` VALUES ('15', '体育学院', '常益', '体育教育，运动训练，民族传统体育', '2019-07-22 19:18:40', '2019-07-22 19:18:40', '4');
INSERT INTO `news` VALUES ('16', '历史文化学院', '董俊', '历史学，历史学基地班，旅游管理，', '2019-07-22 18:55:43', '2019-07-22 18:55:43', '2');
INSERT INTO `news` VALUES ('17', '生命科学学院', '刘德赢', '生物科学，生物技术', '2019-07-22 19:18:15', '2019-07-22 19:18:15', '1');
INSERT INTO `news` VALUES ('18', '数学与统计学院', '任丽涛', '数学与应用数学，统计学', '2019-07-22 19:36:35', '2019-07-22 19:36:35', '1');
INSERT INTO `news` VALUES ('19', '教育学部', '白冰', '教育学，公共事业（教育）管理，小学教育，学前教育', '2019-07-22 18:53:55', '2019-07-22 18:53:55', '2');
INSERT INTO `news` VALUES ('20', ' 文学院', '赵建立', '国际语言文学，新闻', '2019-07-22 19:24:22', '2019-07-22 19:24:22', '2');
INSERT INTO `news` VALUES ('21', '马克思主义学部', '潘宛莹', '马克思主义理论，思想政治教育', '2019-07-22 19:12:09', '2019-07-22 19:12:09', '2');
INSERT INTO `news` VALUES ('22', '国际汉学院', '王百元', '汉语强化，汉语言基础', '2019-07-22 19:37:27', '2019-07-22 19:37:27', '6');
INSERT INTO `news` VALUES ('23', '地理科学学院', '陈静', '地理科学，人文地理与城乡规划，地理信息科学', '2019-07-22 19:37:23', '2019-07-22 19:37:23', '1');
INSERT INTO `news` VALUES ('26', '1', '2', '3', '2019-07-25 19:56:18', '2019-07-25 19:56:18', null);
INSERT INTO `news` VALUES ('27', '2', '3', '4', '2019-07-25 19:58:59', '2019-07-25 19:58:59', null);
